<template>
  <div class="faq">
    <div class="container">
      <h1 v-animate-onscroll="'animated fadeIn'">
        FAQ
      </h1>
      <div class="faq__desc">
        Мы&nbsp;постарались ответить на&nbsp;самые популярные вопросы, которые к&nbsp;нам поступают. Если вы&nbsp;не&nbsp;нашли нужный ответ, то&nbsp;просто свяжитесь с&nbsp;нами любым удобным способом
      </div>
      <div class="faq__questions">
        <div class="faq__questions_question">
          Какие у вас есть линзы для очков?
        </div>
        <div class="faq__questions_answer">
          Мы представляем линзы от лучших производителей в мире: ESSILOR, RODENSTOHK, CARL ZEISS, CRYOL, и другие.
        </div>
        <div class="faq__questions_question">
          Делаете ли вы ремонт очков?
        </div>
        <div class="faq__questions_answer">
          Да, мы делаем ремонт очков и выдаем их в тот же день так как у нас есть своя мастерская вот уже 22 года.
        </div>
        <div class="faq__questions_question">
          Что такое прогрессивные линзы? 
        </div>
        <div class="faq__questions_answer">
          Прогрессивные очки — это очки с прогрессивными линзами, которые могут быть изготовлены из стекла или из пластика. Они предназначены для коррекции зрения на дальнее, среднее и близкое расстояние.
        </div>
        <div class="faq__questions_question">
          Можно ли заказать в вашей мастерской изготовление очков с прогрессивными или офисными линзами?
        </div>
        <div class="faq__questions_answer">
          Наша мастерская занимается изготовлением очков любой сложности, в том числе прогрессивных, офисных, бифокальных, перифокальных, призматических, астигматических, а также различных солнцезащитных очков. Все очки производятся в строгом соответствии с рецептом офтальмолога на основании индивидуальных пожеланий и особенностей заказчика. Разметка, изготовление и подгонка линз для очков производится с применением высокоточного компьютерного оборудования.
        </div>
        <div class="faq__questions_question">
          Занимается ли ваша мастерская изготовлением очков для коррекции индивидуального детского астигматизма?
        </div>
        <div class="faq__questions_answer">
          Наши специалисты и мастера имеют соответствующую квалификацию и уделяют особое внимание задачам коррекции индивидуального детского астигматизма, поэтому мы рады предложить нашим юным заказчикам широкий ассортимент продукции по самым привлекательным ценам.
        </div>
        <div class="faq__questions_question">
          Можно ли заказать в вашей мастерской солнцезащитные очки с диоптриями?
        </div>
        <div class="faq__questions_answer">
          Наша мастерская занимается изготовлением солнцезащитных очков с диоптриями на протяжении многих лет. Большой опыт, накопленный в процессе производства таких очков, позволяет нам выполнять самые сложные заказы с учетом малейших пожеланий наших заказчиков.
        </div>
        <div class="faq__questions_question">
          Какие из недорогих вариантов оправ и очков представлены в ваших салонах оптики?
        </div>
        <div class="faq__questions_answer">
          В наших салонах оптики вы всегда можете найти оправы ценой от 700 рублей, при выборе которых индивидуальный заказ очков обойдется в сумму от 1500 рублей. В товарном ассортименте наших салонов также представлена широкая линейка оправ эконом-класса в ценовом диапазоне от 500 до 1500 рублей, предназначенная специально для молодежи, студентов, пожилых людей и пенсионеров. Несмотря на невысокую цену, данные оправы имеют одни из лучших показателей соотношения цена/качество в своем классе.
        </div>
        <div class="faq__questions_question">
          Почему вредно носить готовые очки?
        </div>
        <div class="faq__questions_answer">
          Вы можете нанести своему зрению непоправимый вред.
          Зрение каждого человека уникально, диоптрии очков и межцентровое расстояние подбираются индивидуально и только профессиональными оптометристами и врачами-офтальмологами.
          Покупая готовые очки, без учета параметров своего рецепта, Вы рискуете получить головную боль, головокружение, резь в глазах и как минимум нечеткое некомфортное зрение. И чем дольше будете ими пользоваться, тем более серьезные проблемы со здоровьем могут появиться в дальнейшем.
          Только специалист сможет правильно померить межцентровое расстояние и правильно рассчитать его для дали и для близи. Расстояние для дали и для близи у одного и того же человека всегда разное. Когда мы смотрим вдаль, глаза находятся ровно, а когда читаем или смотрим на близком расстоянии глаза сходятся. Разница между межцентровым расстоянием очков для дали и межцентровым расстоянием очков для близи у одного человека может достигать 4 мм. Поэтому в рецепте для дали будет выписано одно расстояние между центрами зрачков, а в рецепте для близи будет другое и это будет комфортно.
        </div> 
        <div class="faq__questions_question">
          Какие есть правила ношения очков? 
        </div>
        <div class="faq__questions_answer">
          Существует несколько несложных правил, выполнение которых поможет продлить срок службы ваших очков:
          <div>
          — снимать и одевать очки, придерживая двумя руками за оба заушника;
          </div><div>
          — не класть очки линзами вниз на твердую поверхность;
          </div><div>
          — не оставлять очки рядом с источником света или тепла;
          </div><div>
          — для удаления загрязнений использовать салфетку из микрофибры и специальный спрей;
          </div><div>
          — во избежании деформации - хранить очки нужно в жестком футляре
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<style lang="sass">

.faq
  padding-bottom: 150px
  &__desc
    color: black
    font-size: $regular-fsz
    font-weight: 300
    line-height: 1.55
    padding-top: 20px
  &__questions
    padding-top: 30px
    &:last-child
      border-bottom: 3px solid $primary-pink
    &_question
      font-size: $big-regular
      border-top: 3px solid $primary-pink
      padding: 20px 10px 0 10px
      color: black
    &_answer
      font-size: $regular-fsz
      font-weight: 300
      padding: 20px

</style>